# ‚úÖ SQL vs Python ‚Äì Full Comparison (with Syntax)

In [ ]:
| Feature      | SQL                                                    | Python                                                         |
| ------------ | ------------------------------------------------------ | -------------------------------------------------------------- |
| **Main Use** | Querying and managing data in databases                | General-purpose programming, data analysis, automation, AI, ML |
| **Works On** | Tables in databases (MySQL, PostgreSQL, MSSQL, Oracle) | Files, dataframes, APIs, calculations, scripts                 |
| **Best For** | Filtering, joining, grouping large datasets            | Computations, logic, loops, ML, visualizations                 |

In [ ]:
| Task                   | Winner     |
| ---------------------- | ---------- |
| Large database queries | **SQL**    |
| Data cleaning          | **Python** |
| Machine Learning       | **Python** |
| Reporting on DB        | **SQL**    |

In [ ]:
üëâ SQL = Best for querying structured data
üëâ Python = Best for data analysis, cleaning, ML, automation

# ‚≠ê 1. SELECT Data

In [ ]:
# SQL

select name,age from customer ;

# Python (Pandas)

df[["name","age"]]

# ‚≠ê 2. WHERE Filter

In [ ]:
# SQL

SELECT * 
FROM students 
WHERE age > 18;

# Python

df[df["age"] > 18]

# ‚≠ê 3. ORDER BY (Sorting)

In [ ]:
# SQL

SELECT * 
FROM students 
ORDER BY age DESC;

# Python

df.sort_values(by="age", ascending=False)

# ‚≠ê 4. GROUP BY

In [ ]:
# SQL

SELECT department, AVG(salary) AS avg_salary
FROM employees
GROUP BY department;

# Python

df.groupby("department")["salary"].mean()

# ‚≠ê 5. JOIN Two Tables

In [ ]:
# SQL

SELECT *
FROM orders o
JOIN customers c
ON o.customer_id = c.customer_id;

# Python

merged_df = orders.merge(customers, on="customer_id", how="inner")

# ‚≠ê 6. INSERT Data

In [ ]:
# SQL

INSERT INTO students (name, age) 
VALUES ('Amit', 21);

# Python

df.loc[len(df)] = ["Amit", 21]

# ‚≠ê 7. UPDATE Data

In [ ]:
# SQL

UPDATE students
SET age = 22
WHERE name = 'Amit';

# Python

df.loc[df["name"] == "Amit", "age"] = 22

# ‚≠ê 8. DELETE Data

In [ ]:
# SQL

DELETE FROM students 
WHERE age < 18;

# Python

df = df[df["age"] >= 18]

# üî∂ Example: Full Comparison in One Problem

In [ ]:
# SQL

SELECT product, SUM(amount) AS total_sales
FROM sales
GROUP BY product;

# Python

df.groupby("product")["amount"].sum()

In [1]:
cars = [
    {
     "Company": "Ferrari", 
     'Car Name': 'Roma', 
     'Engine': 'V8',
     'HorsePower':612, 
     "Top Speed": "320km/h",
     "Price": 230000, 
     "Fuel": "Petrol", 
     "Seats": '2+2'
    },
    {
     "Company": "Lamborghini", 
     "Car Name": "Huracan", 
     "Engine": "V10",
     "HorsePower":640, 
     "Top Speed": "325km/h",
     "Price": 300000, 
     "Fuel": "Petrol", 
     "Seats": 2 
    },
    { 
     "Company": "Rolls Royce", 
     'Car Name': 'Ghost', 
     'Engine': 'V12',
     'HorsePower': "missing", 
     "Top Speed": "250km/h",
     "Price": 315000, 
     "Fuel": "Petrol", 
     "Seats": 5 
    },
    { 
     "Company": "Mercedes", 
     'Car Name': 'AMG GT', 
     'Engine': 'V8',
     'HorsePower':523, 
     "Top Speed": "310km/h",
     "Price": "missing", 
     "Fuel": "Petrol", 
     "Seats": 2 
    },
    {  
     "Company": "BMW", 
     "Car Name": "M4", 
     "Engine": "I6",
     "HorsePower": 503, 
     "Top Speed": "290km/h",
     "Price": 75000, 
     "Fuel": "Petrol", 
     "Seats": 4 
    },
    { 
     "Company": "Toyota", 
     'Car Name': 'Supra', 
     'Engine': 'I4',
     'HorsePower':382, 
     "Top Speed": "250km/h",
     "Price": 54000, 
     "Fuel": "Petrol", 
     "Seats": 2 
    },
    { 
     "Company": "Audi", 
     'Car Name': 'R8', 
     'Engine': 'V10',
     'HorsePower':602, 
     "Top Speed": "missing",
     "Price": 170000, 
     "Fuel": "Petrol", 
     "Seats": 2 },
    { 
     "Company": "Aston Martin", 
     'Car Name': 'Vantage', 
     'Engine': 'V12',
     'HorsePower':563, 
     "Top Speed": "250km/h",
     "Price": "nan", 
     "Fuel": "Petrol", 
     "Seats": 5 }
]

import pandas as pd
df=pd.DataFrame(cars)
df

        Company Car Name Engine HorsePower Top Speed    Price    Fuel Seats
0       Ferrari     Roma     V8        612   320km/h   230000  Petrol   2+2
1   Lamborghini  Huracan    V10        640   325km/h   300000  Petrol     2
2   Rolls Royce    Ghost    V12    missing   250km/h   315000  Petrol     5
3      Mercedes   AMG GT     V8        523   310km/h  missing  Petrol     2
4           BMW       M4     I6        503   290km/h    75000  Petrol     4
5        Toyota    Supra     I4        382   250km/h    54000  Petrol     2
6          Audi       R8    V10        602   missing   170000  Petrol     2
7  Aston Martin  Vantage    V12        563   250km/h      nan  Petrol     5

In [ ]:
# ‚≠ê 1. SELECT Data

In [2]:
df["Company"]

0         Ferrari
1     Lamborghini
2     Rolls Royce
3        Mercedes
4             BMW
5          Toyota
6            Audi
7    Aston Martin
Name: Company, dtype: object

In [3]:
df[["Company","Price"]]

        Company    Price
0       Ferrari   230000
1   Lamborghini   300000
2   Rolls Royce   315000
3      Mercedes  missing
4           BMW    75000
5        Toyota    54000
6          Audi   170000
7  Aston Martin      nan

In [ ]:
# ‚≠ê 2. WHERE Filter

In [29]:
# df["Price"] = pd.to_numeric(df["Price"])

df[df["Price"] > 200000]

       Company Car Name Engine HorsePower Top Speed     Price    Fuel Seats
0      Ferrari     Roma     V8        612   320km/h  230000.0  Petrol   2+2
1  Lamborghini  Huracan    V10        640   325km/h  300000.0  Petrol     2
2  Rolls Royce    Ghost    V12    missing   250km/h  315000.0  Petrol     5

In [31]:
df[df["Price"] > 200000]

       Company Car Name Engine HorsePower Top Speed     Price    Fuel Seats
0      Ferrari     Roma     V8        612   320km/h  230000.0  Petrol   2+2
1  Lamborghini  Huracan    V10        640   325km/h  300000.0  Petrol     2
2  Rolls Royce    Ghost    V12    missing   250km/h  315000.0  Petrol     5

In [38]:
df["Company"].isin(["Defender","BMW"])

0    False
1    False
2    False
3    False
4     True
5    False
6    False
7    False
Name: Company, dtype: bool

In [41]:
df.isna().sum()

Company       0
Car Name      0
Engine        0
HorsePower    0
Top Speed     0
Price         2
Fuel          0
Seats         0
dtype: int64

In [ ]:
# ‚≠ê 3. ORDER BY (Sorting)

In [23]:
df.sort_values(by="Price",ascending=False)

        Company Car Name Engine HorsePower Top Speed     Price    Fuel Seats
2   Rolls Royce    Ghost    V12    missing   250km/h  315000.0  Petrol     5
1   Lamborghini  Huracan    V10        640   325km/h  300000.0  Petrol     2
0       Ferrari     Roma     V8        612   320km/h  230000.0  Petrol   2+2
6          Audi       R8    V10        602   missing  170000.0  Petrol     2
4           BMW       M4     I6        503   290km/h   75000.0  Petrol     4
5        Toyota    Supra     I4        382   250km/h   54000.0  Petrol     2
3      Mercedes   AMG GT     V8        523   310km/h       NaN  Petrol     2
7  Aston Martin  Vantage    V12        563   250km/h       NaN  Petrol     5

In [25]:
df.sort_values(by=["Company","Price"], ascending=[True,False])

        Company Car Name Engine HorsePower Top Speed     Price    Fuel Seats
7  Aston Martin  Vantage    V12        563   250km/h       NaN  Petrol     5
6          Audi       R8    V10        602   missing  170000.0  Petrol     2
4           BMW       M4     I6        503   290km/h   75000.0  Petrol     4
0       Ferrari     Roma     V8        612   320km/h  230000.0  Petrol   2+2
1   Lamborghini  Huracan    V10        640   325km/h  300000.0  Petrol     2
3      Mercedes   AMG GT     V8        523   310km/h       NaN  Petrol     2
2   Rolls Royce    Ghost    V12    missing   250km/h  315000.0  Petrol     5
5        Toyota    Supra     I4        382   250km/h   54000.0  Petrol     2

In [ ]:
# ‚≠ê 4. GROUP BY

In [32]:
df.groupby("Engine")["Price"].sum()

Engine
I4      54000.0
I6      75000.0
V10    470000.0
V12    315000.0
V8     230000.0
Name: Price, dtype: float64

In [34]:
# ‚≠ê 5. JOIN Two Tables

In [ ]:
merged_df = orders.merge(customers, on="customer_id", how="inner")

In [ ]:
# ‚≠ê 6. INSERT Data

In [46]:
new_row = pd.DataFrame({"Company": ["Land Rover"], "Car Name": ["Defender"]})

df = pd.concat([df, new_row], ignore_index=True)
df

,Company,Car Name,Engine,HorsePower,Top Speed,Price,Fuel,Seats,Car NAme
0,Ferrari,Roma,V8,612,320km/h,230000.0,Petrol,2+2,NaN
1,Lamborghini,Huracan,V10,640,325km/h,300000.0,Petrol,2,NaN
2,Rolls Royce,Ghost,V12,missing,250km/h,315000.0,Petrol,5,NaN
3,Mercedes,AMG GT,V8,523,310km/h,NaN,Petrol,2,NaN
4,BMW,M4,I6,503,290km/h,75000.0,Petrol,4,NaN
5,Toyota,Supra,I4,382,250km/h,54000.0,Petrol,2,NaN
6,Audi,R8,V10,602,missing,170000.0,Petrol,2,NaN
7,Aston Martin,Vantage,V12,563,250km/h,NaN,Petrol,5,NaN
8,Land Rover,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Defender
9,Land Rover,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Defender
10,Land Rover,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Defender
11,Land Rover,Defender,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [47]:
# df.loc[len(df)] = ["Amit", 21]
df.loc[len(df)]=["Defender"]

In [ ]:
# ‚≠ê 7. UPDATE Data

In [49]:
# df.loc[df["name"] == "Amit", "age"] = 22
df.loc[df["Company"]=="Land Rover","Car Name"]="Range Rover"
df

,Company,Car Name,Engine,HorsePower,Top Speed,Price,Fuel,Seats,Car NAme
0,Ferrari,Roma,V8,612,320km/h,230000.0,Petrol,2+2,NaN
1,Lamborghini,Huracan,V10,640,325km/h,300000.0,Petrol,2,NaN
2,Rolls Royce,Ghost,V12,missing,250km/h,315000.0,Petrol,5,NaN
3,Mercedes,AMG GT,V8,523,310km/h,NaN,Petrol,2,NaN
4,BMW,M4,I6,503,290km/h,75000.0,Petrol,4,NaN
5,Toyota,Supra,I4,382,250km/h,54000.0,Petrol,2,NaN
6,Audi,R8,V10,602,missing,170000.0,Petrol,2,NaN
7,Aston Martin,Vantage,V12,563,250km/h,NaN,Petrol,5,NaN
8,Land Rover,Range Rover,NaN,NaN,NaN,NaN,NaN,NaN,Defender
9,Land Rover,Range Rover,NaN,NaN,NaN,NaN,NaN,NaN,Defender
10,Land Rover,Range Rover,NaN,NaN,NaN,NaN,NaN,NaN,Defender
11,Land Rover,Range Rover,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
# ‚≠ê 8. DELETE Data

In [50]:
# df = df[df["age"] >= 18]
df.drop("Car NAme",axis=1)

,Company,Car Name,Engine,HorsePower,Top Speed,Price,Fuel,Seats
0,Ferrari,Roma,V8,612,320km/h,230000.0,Petrol,2+2
1,Lamborghini,Huracan,V10,640,325km/h,300000.0,Petrol,2
2,Rolls Royce,Ghost,V12,missing,250km/h,315000.0,Petrol,5
3,Mercedes,AMG GT,V8,523,310km/h,NaN,Petrol,2
4,BMW,M4,I6,503,290km/h,75000.0,Petrol,4
5,Toyota,Supra,I4,382,250km/h,54000.0,Petrol,2
6,Audi,R8,V10,602,missing,170000.0,Petrol,2
7,Aston Martin,Vantage,V12,563,250km/h,NaN,Petrol,5
8,Land Rover,Range Rover,NaN,NaN,NaN,NaN,NaN,NaN
9,Land Rover,Range Rover,NaN,NaN,NaN,NaN,NaN,NaN
10,Land Rover,Range Rover,NaN,NaN,NaN,NaN,NaN,NaN
11,Land Rover,Range Rover,NaN,NaN,NaN,NaN,NaN,NaN